experimental_cases/disengagement/bubble_column_pbe_20L/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     birdmultiphaseEulerFoam;

startFrom       latestTime;//startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       0.0005;


functions
{

    #includeFunc    writeObjects(d.gas)
    #includeFunc    writeObjects(thermo:rho.gas)
    #includeFunc    writeObjects(thermo:rho.liquid)
    #includeFunc    writeObjects(thermo:mu.gas)
    #includeFunc    writeObjects(thermo:mu.liquid)
    disengagement
    {
        type            disengagement;
        libs            ("libbirdmultiphaseEulerFoamFunctionObjects.so");

        //- Properties common to all functionObjects
        executeControl  runTime;
        executeInterval 0.01;
        writeControl    runTime;
        writeInterval   0.1; 

        //- Properties specific of this functionobject
        phase           liquid;
        inletPhase      gas;
        inlet           inlet;
        tolerance       1e-2;
        direction       (0 1 0);
        nsamples        50;
        disengage       true;   
    }
}


// ************************************************************************* //
